{
  "backend/main.mo": "Defines an empty Internet Computer actor with no methods implemented due to missing specifications.",
  "feature_evidence.json": "Feature evidence report documenting a high-confidence frontend change updating the description text of the first visible gallery image in siteConfig.ts.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend source files, components, configuration, and styling for build and feature planning.",
  "frontend/index.css": "Global Tailwind CSS entry defining OKLCH-based light/dark theme variables, borders, and base background/foreground styling.",
  "frontend/index.html": "HTML entry point that mounts the React app to the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that applies theme support and conditionally renders site sections based on sectionVisibility config.",
  "frontend/src/components/FinaleSection.tsx": "Romantic finale section displaying animated icons, heartfelt messages, and a signature birthday message from Avdhesh.",
  "frontend/src/components/Footer.tsx": "Footer component that shows attribution, animated heart icon, and dynamic navigation links based on enabled sections.",
  "frontend/src/components/Gallery.tsx": "Gallery section that renders visible images from config as cards and opens a modal for the selected image.",
  "frontend/src/components/Header.tsx": "Sticky header with dynamic navigation, theme toggle, branding, and smooth scrolling to enabled sections.",
  "frontend/src/components/Hero.tsx": "Intro hero section with birthday messaging, decorative backgrounds, and CTA buttons that link to enabled sections.",
  "frontend/src/components/ImageCard.tsx": "Reusable animated card component for gallery images with lazy loading, hover effects, and title/description display.",
  "frontend/src/components/ImageModal.tsx": "React modal component that displays a selected image with title and description using a Dialog UI, including a close button and optional debug info (image ID and filename).",
  "frontend/src/components/MusicControl.tsx": "Floating music player control that plays/pauses a looping background audio track and allows volume adjustment via a popover slider.",
  "frontend/src/components/RobloxSection.tsx": "Static presentation section highlighting shared Roblox experiences with themed text, icons, and an image, styled for a romantic gaming theme.",
  "frontend/src/content/siteConfig.ts": "Central configuration file defining section visibility flags, navigation types, debug toggles, and a gallery image dataset with metadata and optional hidden flags.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, switching between anonymous and authenticated actors based on Internet Identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, handling login, logout, persisted identity loading, and detailed login status state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook intended for future backend query implementations, currently returning an empty object.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, romantic color palette, dark mode overrides, base styles, and custom animation utilities.",
  "frontend/src/main.tsx": "Application entry point that initializes React with QueryClient and InternetIdentity providers and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend source files, and extending the theme with OKLCH-based color tokens, custom radii, fonts, shadows, and layout settings. Includes plugins for typography, container queries, and animations to support a design-system-driven UI.",
  "project_state.json": "Machine-readable snapshot of the project vision and progress, describing a pivot to a single-page Hello Kitty–themed birthday website and listing implemented features with IDs, descriptions, and versions. Acts as a living record of scope, features, and design-system decisions for planning and iteration."
}