{
  "backend/main.mo": "Actor placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing purpose of various frontend components and config files.",
  "frontend/index.css": "Defines Tailwind layers, theme variables, and base styling for light and dark modes.",
  "frontend/index.html": "Basic HTML shell mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component that renders sections conditionally based on siteConfig visibility.",
  "frontend/src/components/CakeSection.tsx": "Interactive cake UI with candle-blowout animation and popup dialog triggered on click.",
  "frontend/src/components/FinaleSection.tsx": "Romantic finale section displaying themed messages, icons, and a styled sender signature.",
  "frontend/src/components/Footer.tsx": "Footer that generates navigation buttons from siteConfig and scrolls to sections smoothly.",
  "frontend/src/components/Gallery.tsx": "Image gallery showing visible images from config with modal support for viewing selections.",
  "frontend/src/components/Header.tsx": "Renders a sticky header with logo, navigation buttons, and a dark/light theme toggle, using section scroll behavior.",
  "frontend/src/components/Hero.tsx": "Displays the intro hero section with themed text, images, and buttons that scroll to other sections based on visibility.",
  "frontend/src/components/ImageCard.tsx": "Shows a gallery image card with hover effects, lazy loading, and click handling to open a modal.",
  "frontend/src/components/ImageModal.tsx": "Provides a modal to display an enlarged image with title, description, and optional debug info.",
  "frontend/src/components/MusicControl.tsx": "Implements floating music controls with play/pause and adjustable volume using a popover slider.",
  "frontend/src/components/RobloxSection.tsx": "Renders a themed section highlighting Roblox adventures with descriptive text and an image.",
  "frontend/src/content/siteConfig.ts": "Defines configuration for section visibility, gallery images, navigation items, and debug options.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes, invalidating queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty object for future backend queries.",
  "frontend/src/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, fonts, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, plugins, OKLCH-based theme extensions, and custom container and font settings.",
  "project_state.json": "Metadata describing project status, architecture, issues, and required/generated image assets."
}